#+TITLE: Examples SPARQL Queries (RDF Query Language)

SPARQL is a query language for RDF data. The syntax of the language bears some similarity with SQL. The user specifies graph patterns with variables that are matched against an RDF graph. For every match, the bindings of the variables are then available for further processing.

* Triple patterns (graph patterns)

At the core of SPARQL queries are triple patterns which like RDF triples are tuples of subject, predicate, and object. Triple patterns consist of variables (prefixed by =?=) and constants.  The triple patterns in SPARQL in the =WHERE= clause. SPARQL queries return tuples of variable bindings for all bindings of the variables in the triple patterns such that the subgraph defined by the tuple patterns after applying the bindings exists in the RDF graph. Since most elements in SPARQL queries are URIs which can be lengthy, it is possible to define per-query abbreviations of


#+begin_src sparql :url http://db.artsdata.ca/repositories/artsdata :format text/csv
prefix rdft: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>
SELECT *
WHERE {
  	?s ?p ?o
      }
LIMIT 50
#+end_src

#+RESULTS:
| s                                                                | p                                               | o                                                   |
|------------------------------------------------------------------+-------------------------------------------------+-----------------------------------------------------|
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type                  | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/1999/02/22-rdf-syntax-ns#Property |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type                  | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#Property              | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Class          |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#Property              | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2000/01/rdf-schema#Class                       | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Class          |
| http://www.w3.org/2000/01/rdf-schema#Class                       | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2000/01/rdf-schema#Resource                    | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Class          |
| http://www.w3.org/2000/01/rdf-schema#Resource                    | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2000/01/rdf-schema#subPropertyOf               | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/1999/02/22-rdf-syntax-ns#Property |
| http://www.w3.org/2000/01/rdf-schema#subPropertyOf               | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2000/01/rdf-schema#subPropertyOf               | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2002/07/owl#TransitiveProperty    |
| http://www.w3.org/2000/01/rdf-schema#subClassOf                  | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/1999/02/22-rdf-syntax-ns#Property |
| http://www.w3.org/2000/01/rdf-schema#subClassOf                  | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2000/01/rdf-schema#subClassOf                  | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2002/07/owl#TransitiveProperty    |
| http://www.w3.org/2000/01/rdf-schema#domain                      | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/1999/02/22-rdf-syntax-ns#Property |
| http://www.w3.org/2000/01/rdf-schema#domain                      | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2000/01/rdf-schema#range                       | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/1999/02/22-rdf-syntax-ns#Property |
| http://www.w3.org/2000/01/rdf-schema#range                       | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#sameAs                             | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/1999/02/22-rdf-syntax-ns#Property |
| http://www.w3.org/2002/07/owl#sameAs                             | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#SymmetricProperty                  | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#TransitiveProperty                 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#equivalentProperty                 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/1999/02/22-rdf-syntax-ns#Property |
| http://www.w3.org/2002/07/owl#equivalentProperty                 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#equivalentProperty                 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2002/07/owl#SymmetricProperty     |
| http://www.w3.org/2002/07/owl#equivalentProperty                 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2002/07/owl#TransitiveProperty    |
| http://www.w3.org/2002/07/owl#equivalentClass                    | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/1999/02/22-rdf-syntax-ns#Property |
| http://www.w3.org/2002/07/owl#equivalentClass                    | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#equivalentClass                    | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2002/07/owl#SymmetricProperty     |
| http://www.w3.org/2002/07/owl#equivalentClass                    | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2002/07/owl#TransitiveProperty    |
| http://www.w3.org/2000/01/rdf-schema#Datatype                    | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Class          |
| http://www.w3.org/2000/01/rdf-schema#Datatype                    | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#intersectionOf                     | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.ontotext.com/scm_int                                  | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#FunctionalProperty                 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2000/01/rdf-schema#ContainerMembershipProperty | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Class          |
| http://www.w3.org/2000/01/rdf-schema#ContainerMembershipProperty | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://proton.semanticweb.org/protonsys#transitiveOver           | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/1999/02/22-rdf-syntax-ns#Property |
| http://proton.semanticweb.org/protonsys#transitiveOver           | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#someValuesFrom                     | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/1999/02/22-rdf-syntax-ns#Property |
| http://www.w3.org/2002/07/owl#someValuesFrom                     | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://proton.semanticweb.org/protonext#Agent                    | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.ontotext.com/_interOf                                 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.ontotext.com/_allTypes                                | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.ontotext.com/_typeByInt                               | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://proton.semanticweb.org/protonext#roleHolder               | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#allValuesFrom                      | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#inverseOf                          | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/1999/02/22-rdf-syntax-ns#Property |
| http://www.w3.org/2002/07/owl#inverseOf                          | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2000/01/rdf-schema#Resource       |
| http://www.w3.org/2002/07/owl#inverseOf                          | http://www.w3.org/1999/02/22-rdf-syntax-ns#type | http://www.w3.org/2002/07/owl#SymmetricProperty     |

* Filtering
* Limiting number of results
* Aggregation
